Import the libraries
import pandas as pd
import numpy as np
import matplot

In [1]:
import pandas as pd   
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns
sns.set(style="whitegrid")

Step 2 : load the dataset

In [2]:
sales_data = pd.read_csv('sales_data.csv')

copy this  dataset to another variable for further analysis

In [3]:
sale_pd = sales_data.copy()

TO read the first 5 rows of the data set, use the following command:

In [4]:
sale_pd.head()

,Order_ID,Product,Category,Quantity,Unit_Price,Total_Price,Order_Date,Customer_Age,City
0,1001,Laptop,Electronics,2.0,700.0,1400.0,2024-01-10,29,New York
1,1002,Smartphone,Electronics,1.0,500.0,NaN,2024-02-15,35,Los Angeles
2,1003,Washing Machine,Home Appliances,NaN,300.0,600.0,2024-03-05,40,Chicago
3,1004,Tablet,Electronics,3.0,NaN,1200.0,2024-01-25,28,Houston
4,1005,Refrigerator,Home Appliances,1.0,1000.0,1000.0,2024-04-12,50,Miami

Step 3 : To understand the dataset using following commands

In [5]:
sale_pd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order_ID      7 non-null      int64
 1   Product       7 non-null      object
 2   Category      7 non-null      object
 3   Quantity      5 non-null      float64
 4   Unit_Price    6 non-null      float64
 5   Total_Price   6 non-null      float64
 6   Order_Date    7 non-null      object
 7   Customer_Age  7 non-null      int64
 8   City          7 non-null      object
dtypes: float64(3), int64(2), object(4)
memory usage: 636.0+ bytes

Here i see that a some missing values are present in the data set, i  also  observe the dataType in the data set

Step 4 : Identify the missing values in the dataset

In [6]:
sale_pd.isnull().sum()

Order_ID        0
Product         0
Category        0
Quantity        2
Unit_Price      1
Total_Price     1
Order_Date      0
Customer_Age    0
City            0
dtype: int64

In Quantity column and unit_price , total_price have some missing values.

In [8]:
sale_pd['Order_ID'].unique()

array([1001, 1002, 1003, 1004, 1005, 1006, 1007])

Order_Id column do not impact on the data so remove it

In [13]:
sale_pd = sale_pd.drop('Order_ID', axis=1)

In [14]:
sale_pd.head()

,Product,Category,Quantity,Unit_Price,Total_Price,Order_Date,Customer_Age,City
0,Laptop,Electronics,2.0,700.0,1400.0,2024-01-10,29,New York
1,Smartphone,Electronics,1.0,500.0,NaN,2024-02-15,35,Los Angeles
2,Washing Machine,Home Appliances,NaN,300.0,600.0,2024-03-05,40,Chicago
3,Tablet,Electronics,3.0,NaN,1200.0,2024-01-25,28,Houston
4,Refrigerator,Home Appliances,1.0,1000.0,1000.0,2024-04-12,50,Miami

Fill the missing values by using the mean of the column

In [16]:
sale_pd['Quantity'].isnull().sum()

np.int64(2)

In [18]:
sale_pd['Quantity'] = sale_pd['Quantity'].fillna(np.mean(sale_pd['Quantity']))

In [21]:
sale_pd['Quantity']

0    2.0
1    1.0
2    1.8
3    3.0
4    1.0
5    2.0
6    1.8
Name: Quantity, dtype: float64

So i fill the missing values with the mean of the column

In [22]:
sale_pd['Unit_Price'].isnull().sum()

np.int64(1)

In [23]:
sale_pd['Unit_Price']  = sale_pd['Unit_Price'].fillna(np.mean(sale_pd['Unit_Price']))

In [26]:
sale_pd['Unit_Price'].astype(int)

0     700
1     500
2     300
3     616
4    1000
5     700
6     500
Name: Unit_Price, dtype: int64

In total_price it is the multiplication of quantity and price

In [28]:
sale_pd['Total_Price'].isnull().sum()

np.int64(1)

In [29]:
sale_pd['Total_Price'] = sale_pd['Quantity'] * sale_pd['Unit_Price']

In [31]:
sale_pd['Total_Price'].astype(int)

0    1400
1     500
2     540
3    1850
4    1000
5    1400
6     900
Name: Total_Price, dtype: int64

In order_date column the data in the from of string is stored. So we need to convert it into datetime format. We can use the to_datetime()

In [33]:
type(sale_pd['Order_Date'][0])

str

In [35]:
sale_pd['Order_Date'] = pd.to_datetime(sale_pd['Order_Date'])

In [36]:
type(sale_pd['Order_Date'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [40]:
sale_pd['Order_Date'] = sale_pd['Order_Date'].astype(str).str.replace(' 00:00:00', '', regex=False)

In [41]:
sale_pd['Order_Date']

0    2024-01-10
1    2024-02-15
2    2024-03-05
3    2024-01-25
4    2024-04-12
5    2024-05-20
6    2024-06-10
Name: Order_Date, dtype: object

In [42]:
sale_pd['Customer_Age'].unique()

array([29, 35, 40, 28, 50, 42, 33])

In [43]:
def age_gp(age):
    if age < 18:
        return "Young"
    if age < 50:
        return "Middle"
    else:
        return "Old"



sale_pd['Customer_Age_Group'] = sale_pd['Customer_Age'].apply(age_gp)

In [45]:
sale_pd['Customer_Age_Group'].unique()

array(['Middle', 'Old'], dtype=object)

In [47]:
sale_pd.to_csv("Cleaned_Sales_Data.csv", index=True)